Revit 2027 API
UpdaterRegistry.GetRegisteredUpdaterInfos Method
Overload List
Name | Description
GetRegisteredUpdaterInfos() |  Returns UpdaterInfos for all the application-wide updaters.
GetRegisteredUpdaterInfos(Document) |  Returns information about all updaters applicable to the given document.
Top
See Also
Reference
UpdaterRegistry Class
Autodesk.Revit.DB Namespace